tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/core"
# Aquarium animation in ASCII art
brew "asciiquarium"
# Bourne-Again SHell, a UNIX command interpreter
brew "bash"
# Interpreted, interactive, object-oriented programming language
brew "python@3.9"
# Console Matrix
brew "cmatrix"
# Configurable talking characters in ASCII art
brew "cowsay"
# GNU compiler collection
brew "gcc"
# Distributed revision control system
brew "git"
# Improved top (interactive process viewer)
brew "htop"
# Interactive environments for writing and running code
brew "jupyterlab"
# Rainbows and unicorns in your console!
brew "lolcat"
# NCurses Disk Usage
brew "ncdu"
# Fast, highly customisable system info script
brew "neofetch"
# Software environment for statistical computing
brew "r"
# File browser
brew "ranger"
# Powerful, clean, object-oriented scripting language
brew "ruby"
# Prints a steam locomotive if you type sl instead of ls
brew "sl"
# Command-line interface for https://speedtest.net bandwidth tests
brew "speedtest-cli"
# Display directories as trees (with optional color/HTML output)
brew "tree"
# Internet file retriever
brew "wget"
# UNIX shell (command interpreter)
brew "zsh"
# Transfer files from and to an Android smartphone
cask "android-file-transfer"
# Web browser focusing on privacy
cask "brave-browser"
# Client for the Dropbox cloud storage service
cask "dropbox"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Data science software focusing on R and Python
cask "rstudio"
# Music streaming service
cask "spotify"
# Tool to hide menu bar icons
cask "vanilla"
# Open-source code editor
cask "visual-studio-code"
# Multimedia player
cask "vlc"
# Desktop client for WhatsApp
cask "whatsapp"
# Video communication and virtual meeting platform
cask "zoom"
